-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: localhost    Database: school_new
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `finance_account`
--

LOCK TABLES `finance_account` WRITE;
/*!40000 ALTER TABLE `finance_account` DISABLE KEYS */;
INSERT INTO `finance_account` VALUES (14208,'فاطمه ابراهیم خمیسی',NULL,'فاطمه ابراهیم خمیسی','09023164468',NULL,'2025-11-18 00:00:00',NULL,0),(14209,'زهرا اسحقی',NULL,'زهرا اسحقی','09140401548',NULL,'2025-11-18 00:00:00',NULL,0),(14210,'زهره باقری',NULL,'زهره باقری','09130152534',NULL,'2025-11-18 00:00:00',NULL,0);
/*!40000 ALTER TABLE `finance_account` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `finance_account_bank`
--

LOCK TABLES `finance_account_bank` WRITE;
/*!40000 ALTER TABLE `finance_account_bank` DISABLE KEYS */;
INSERT INTO `finance_account_bank` VALUES (1,'حساب مرکزی',1,0,_binary '\0'),(2,'صندوق',NULL,0,_binary '');
/*!40000 ALTER TABLE `finance_account_bank` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `finance_bank`
--

LOCK TABLES `finance_bank` WRITE;
/*!40000 ALTER TABLE `finance_bank` DISABLE KEYS */;
INSERT INTO `finance_bank` VALUES (1,'ملی'),(2,'صادرات'),(3,'مسکن'),(4,'سپه');
/*!40000 ALTER TABLE `finance_bank` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `finance_check`
--

LOCK TABLES `finance_check` WRITE;
/*!40000 ALTER TABLE `finance_check` DISABLE KEYS */;
/*!40000 ALTER TABLE `finance_check` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `finance_check_status`
--

LOCK TABLES `finance_check_status` WRITE;
/*!40000 ALTER TABLE `finance_check_status` DISABLE KEYS */;
INSERT INTO `finance_check_status` VALUES (1,'برگشت خورده'),(2,'پاس شده'),(3,'اولیه');
/*!40000 ALTER TABLE `finance_check_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `finance_factor`
--

LOCK TABLES `finance_factor` WRITE;
/*!40000 ALTER TABLE `finance_factor` DISABLE KEYS */;
INSERT INTO `finance_factor` VALUES (34027,14208,-30500000,'2025-11-18 00:00:00',NULL,1),(34028,14209,-25250000,'2025-11-18 00:00:00',NULL,1),(34029,14210,-30500000,'2025-11-18 00:00:00',NULL,1);
/*!40000 ALTER TABLE `finance_factor` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `finance_factor_type`
--

LOCK TABLES `finance_factor_type` WRITE;
/*!40000 ALTER TABLE `finance_factor_type` DISABLE KEYS */;
INSERT INTO `finance_factor_type` VALUES (1,'هزینه ثبت نام'),(2,'هزینه صدور کارت');
/*!40000 ALTER TABLE `finance_factor_type` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `finance_receive_pay_type`
--

LOCK TABLES `finance_receive_pay_type` WRITE;
/*!40000 ALTER TABLE `finance_receive_pay_type` DISABLE KEYS */;
INSERT INTO `finance_receive_pay_type` VALUES (1,'نقدی'),(2,'pos'),(3,'فیش بانکی'),(4,'پاس شدن چک');
/*!40000 ALTER TABLE `finance_receive_pay_type` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `finance_receive_payment`
--

LOCK TABLES `finance_receive_payment` WRITE;
/*!40000 ALTER TABLE `finance_receive_payment` DISABLE KEYS */;
INSERT INTO `finance_receive_payment` VALUES (44249,'2025-10-20 00:00:00',25250000,1,14209,2,NULL,NULL),(44250,'2025-11-18 00:00:00',10000000,1,14210,2,NULL,NULL);
/*!40000 ALTER TABLE `finance_receive_payment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_base`
--

LOCK TABLES `reg_base` WRITE;
/*!40000 ALTER TABLE `reg_base` DISABLE KEYS */;
INSERT INTO `reg_base` VALUES (1,'پايه هفتم'),(2,'پايه هشتم'),(3,'پايه نهم'),(4,'پايه دهم'),(5,'پايه يازدهم'),(6,'پايه دوازدهم');
/*!40000 ALTER TABLE `reg_base` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_base_level`
--

LOCK TABLES `reg_base_level` WRITE;
/*!40000 ALTER TABLE `reg_base_level` DISABLE KEYS */;
/*!40000 ALTER TABLE `reg_base_level` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_course`
--

LOCK TABLES `reg_course` WRITE;
/*!40000 ALTER TABLE `reg_course` DISABLE KEYS */;
INSERT INTO `reg_course` VALUES (111,'24512',NULL,3,NULL,'اجتماعی1',NULL,NULL,NULL),(113,'24612',NULL,3,NULL,'اجتماعی2',NULL,NULL,NULL),(115,'24712',NULL,3,NULL,'اجتماعی3',NULL,NULL,NULL),(120,'24504',NULL,1,NULL,'املاء1',NULL,NULL,NULL),(122,'24604',NULL,1,NULL,'املاء2',NULL,NULL,NULL),(123,'24704',NULL,1,NULL,'املاء3',NULL,NULL,NULL),(131,'24717',NULL,2,NULL,'آمادگی دفاعی3',NULL,NULL,NULL),(140,'24515',NULL,2,NULL,'تفکر و سبک زندگی1',NULL,NULL,NULL),(141,'24615',NULL,2,NULL,'تفکر و سبک زندگی2',NULL,NULL,NULL),(155,'24502',NULL,2,NULL,'معارف اسلامی1',NULL,NULL,NULL),(157,'24602',NULL,2,NULL,'معارف اسلامی2',NULL,NULL,NULL),(158,'24702',NULL,2,NULL,'معارف اسلامی3',NULL,NULL,NULL),(163,'24510',NULL,4,NULL,'ریاضی1',NULL,NULL,NULL),(166,'24610',NULL,4,NULL,'ریاضی2',NULL,NULL,NULL),(167,'24710',NULL,4,NULL,'ریاضی3',NULL,NULL,NULL),(172,'24508',NULL,2,NULL,'زبان خارجه1',NULL,NULL,NULL),(175,'24608',NULL,2,NULL,'زبان خارجه2',NULL,NULL,NULL),(177,'24708',NULL,2,NULL,'زبان خارجه3',NULL,NULL,NULL),(189,'24507',NULL,2,NULL,'عربی1',NULL,NULL,NULL),(191,'24607',NULL,2,NULL,'عربی2',NULL,NULL,NULL),(194,'24707',NULL,2,NULL,'عربی3',NULL,NULL,NULL),(196,'24509',NULL,3,NULL,'علوم تجربی1',NULL,NULL,NULL),(198,'24609',NULL,3,NULL,'علوم تجربی2',NULL,NULL,NULL),(200,'24709',NULL,3,NULL,'علوم تجربی3',NULL,NULL,NULL),(207,'24501',NULL,2,NULL,'قرآن1',NULL,NULL,NULL),(209,'24601',NULL,2,NULL,'قرآن2',NULL,NULL,NULL),(211,'24701',NULL,2,NULL,'قرآن3',NULL,NULL,NULL),(218,'10011',NULL,2,NULL,'دینی و اخلاق1',NULL,NULL,NULL),(219,'10021',NULL,1,NULL,'عربی و زبان قرآن1',NULL,NULL,NULL),(220,'10051',NULL,4,NULL,'ریاضی1',NULL,NULL,NULL),(221,'10061',NULL,2,NULL,'هندسه1',NULL,NULL,NULL),(222,'10071',NULL,2,NULL,'آمادگی دفاعی',NULL,NULL,NULL),(223,'10081',NULL,3,NULL,'زبان خارجی1-نظری',NULL,NULL,NULL),(224,'10101',NULL,4,NULL,'فیزیک1 رشته ریاضی',NULL,NULL,NULL),(225,'10111',NULL,3,NULL,'شیمی1',NULL,NULL,NULL),(226,'11121',NULL,1,NULL,'آزمایشگاه علوم2',NULL,NULL,NULL),(227,'10131',NULL,2,NULL,'جغرافیا عمومی',NULL,NULL,NULL),(228,'10141',NULL,3,NULL,'زیست شناسی1',NULL,NULL,NULL),(229,'10161',NULL,2,NULL,'عربی 1 انسانی',NULL,NULL,NULL),(230,'10171',NULL,2,NULL,'علوم و فنون ادبی1',NULL,NULL,NULL),(231,'10181',NULL,3,NULL,'ریاضی و آمار1',NULL,NULL,NULL),(232,'10191',NULL,3,NULL,'تاریخ1',NULL,NULL,NULL),(233,'10201',NULL,2,NULL,'جامعه شناسی1',NULL,NULL,NULL),(234,'10211',NULL,2,NULL,'اقتصاد',NULL,NULL,NULL),(235,'10221',NULL,2,NULL,'منطق',NULL,NULL,NULL),(236,'10291',NULL,3,NULL,'فیزیک1 تجربی',NULL,NULL,NULL),(238,'10031',NULL,2,NULL,'فارسی1',NULL,NULL,NULL),(239,'10041',NULL,2,NULL,'نگارش 1',NULL,NULL,NULL),(241,'10082',NULL,2,NULL,'زبان خارجه1-کاردانش',NULL,NULL,NULL),(242,'88110',NULL,2,NULL,'الزامات محیط کار',NULL,NULL,NULL),(243,'88510',NULL,2,NULL,'ریاضی1 کاردانش',NULL,NULL,NULL),(244,'11031',NULL,2,NULL,'فارسی 2 - کاردانش',NULL,NULL,NULL),(245,'11241',NULL,3,NULL,'جامعه شناسی 2',NULL,NULL,NULL),(246,'11181',NULL,4,NULL,'دینی و اخلاق 2 انسانی',NULL,NULL,NULL),(248,'11131',NULL,2,NULL,'انسان و محیط زیست',NULL,NULL,NULL),(249,'11081',NULL,3,NULL,'زبان خارجه (2)',NULL,NULL,NULL),(250,'11211',NULL,2,NULL,'ریاضی و آمار2',NULL,NULL,NULL),(252,'11191',NULL,2,NULL,'عربی 2 انسانی',NULL,NULL,NULL),(253,'11021',NULL,2,NULL,'عربی 2 ریاضی وتجربی',NULL,NULL,NULL),(254,'11231',NULL,3,NULL,'تاریخ 2',NULL,NULL,NULL),(255,'11141',NULL,2,NULL,'تاریخ معاصر',NULL,NULL,NULL),(256,'11041',NULL,1,NULL,'نگارش2',NULL,NULL,NULL),(257,'11201',NULL,2,NULL,'علوم و فنون ادبی 2',NULL,NULL,NULL),(258,'11261',NULL,2,NULL,'فلسفه',NULL,NULL,NULL),(259,'11151',NULL,2,NULL,'زمین شناسی',NULL,NULL,NULL),(260,'11251',NULL,2,NULL,'روان شناسی',NULL,NULL,NULL),(261,'10151',NULL,3,NULL,'دینی 1 انسانی',NULL,NULL,NULL),(262,'11082',NULL,2,NULL,'زبان خارجه(2) کاردانش',NULL,NULL,NULL),(263,'11022',NULL,1,NULL,'عربی (2) کاردانش',NULL,NULL,NULL),(264,'11221',NULL,3,NULL,'جغرافیا2',NULL,NULL,NULL),(265,'11051',NULL,2,NULL,'هندسه 2',NULL,NULL,NULL),(266,'14031',NULL,2,NULL,'تفکر و سواد رسانه ای',NULL,NULL,NULL),(267,'11011',NULL,2,NULL,'دینی و اخلاق 2',NULL,NULL,NULL),(268,'11111',NULL,3,NULL,'شیمی 2',NULL,NULL,NULL),(269,'11101',NULL,4,NULL,'فیزیک 2 رشته ریاضی',NULL,NULL,NULL),(270,'11061',NULL,3,NULL,'حسابان1',NULL,NULL,NULL),(271,'11071',NULL,2,NULL,'آمار و احتمال',NULL,NULL,NULL),(274,'11171',NULL,4,NULL,'زیست شناسی2',NULL,NULL,NULL),(275,'12131',NULL,2,NULL,'مدیریت خانواده و سبک زندگی',NULL,NULL,NULL),(276,'12121',NULL,2,NULL,'سلامت و بهداشت ',NULL,NULL,NULL),(277,'12022',NULL,1,NULL,'عربی زبان قرآن3 کاردانش',NULL,NULL,NULL),(278,'12031',NULL,2,NULL,'فارسی 3',NULL,NULL,NULL),(279,'12011',NULL,2,NULL,'دینی و اخلاق3  ',NULL,NULL,NULL),(280,'88150',NULL,2,NULL,'اخلاق حرفه ای',NULL,NULL,NULL),(281,'12141',NULL,2,NULL,'علوم اجتماعی ',NULL,NULL,NULL),(282,'88130',NULL,2,NULL,'مدیریت تولید',NULL,NULL,NULL),(283,'88120',NULL,2,NULL,'کاربرد فناوری های نوین',NULL,NULL,NULL),(286,'12041',NULL,2,NULL,'نگارش3',NULL,NULL,NULL),(287,'11161',NULL,4,NULL,'ریاضی2',NULL,NULL,NULL),(288,'10022',NULL,1,NULL,'عربی و زبان قرآن1-کاردانش',NULL,NULL,NULL),(289,'10121',NULL,2,NULL,'آزمایشگاه علوم 1',NULL,NULL,NULL),(290,'11331',NULL,3,NULL,'فیزیک 2 تجربی',NULL,NULL,NULL),(291,'12241',NULL,2,NULL,'مطالعات فرهنگی',NULL,NULL,NULL),(292,'88901',NULL,2,NULL,'فیزیک1 کاردانش',NULL,NULL,NULL),(293,'10092',NULL,2,NULL,'تربیت بدنی1',NULL,NULL,NULL),(294,'11092',NULL,2,NULL,'تربیت بدنی2',NULL,NULL,NULL),(295,'12091',NULL,2,NULL,'تربیت بدنی3',NULL,NULL,NULL),(297,'88140',NULL,3,NULL,'کارگاه نوآوری و کارآفرینی',NULL,NULL,NULL),(299,'24511',NULL,2,NULL,'تربیت بدنی1',NULL,NULL,NULL),(300,'24513',NULL,2,NULL,'فرهنگ و هنر1',NULL,NULL,NULL),(301,'24514',NULL,2,NULL,'کار و فناوری1',NULL,NULL,NULL),(303,'24711',NULL,2,NULL,'تربیت بدنی3',NULL,NULL,NULL),(304,'24713',NULL,2,NULL,'فرهنگ و هنر3',NULL,NULL,NULL),(305,'24714',NULL,2,NULL,'کار و فناوری3',NULL,NULL,NULL),(315,'24611',NULL,2,NULL,'تربیت بدنی2',NULL,NULL,NULL),(316,'24613',NULL,2,NULL,'فرهنگ و هنر2',NULL,NULL,NULL),(317,'24614',NULL,2,NULL,'کاروفناوری2',NULL,NULL,NULL),(321,'12021',NULL,2,NULL,'عربی،زبان قرآن3',NULL,NULL,NULL),(323,'12051',NULL,2,NULL,'هندسه3',NULL,NULL,NULL),(324,'12061',NULL,3,NULL,'حسابان2',NULL,NULL,NULL),(325,'12071',NULL,2,NULL,'ریاضیات گسسته',NULL,NULL,NULL),(326,'12081',NULL,4,NULL,'زبان خارجی3',NULL,NULL,NULL),(328,'12101',NULL,4,NULL,'فیزیک 3 ',NULL,NULL,NULL),(329,'12111',NULL,4,NULL,'شیمی3',NULL,NULL,NULL),(333,'12151',NULL,4,NULL,'زیست شناسی3',NULL,NULL,NULL),(334,'12161',NULL,4,NULL,'ریاضی3',NULL,NULL,NULL),(335,'12331',NULL,3,NULL,'فیزیک3 تجربی',NULL,NULL,NULL),(336,'12171',NULL,4,NULL,'دینی 3 انسانی',NULL,NULL,NULL),(337,'12181',NULL,2,NULL,'عربی3 انسانی',NULL,NULL,NULL),(338,'12191',NULL,2,NULL,'علوم و فنون ادبی3',NULL,NULL,NULL),(339,'12201',NULL,2,NULL,'ریاضی و آمار3',NULL,NULL,NULL),(340,'12211',NULL,2,NULL,'جغرافیا3',NULL,NULL,NULL),(341,'12221',NULL,2,NULL,'تاریخ3',NULL,NULL,NULL),(342,'12231',NULL,3,NULL,'جامعه شناسی3',NULL,NULL,NULL),(344,'12251',NULL,2,NULL,'فلسفه2',NULL,NULL,NULL),(345,'24520',NULL,2,NULL,'فارسی1',NULL,NULL,NULL),(346,'24521',NULL,1,NULL,'نگارش 1',NULL,NULL,NULL),(347,'24620',NULL,2,NULL,'فارسی2',NULL,NULL,NULL),(348,'24621',NULL,1,NULL,'نگارش2',NULL,NULL,NULL),(349,'24720',NULL,2,NULL,'فارسی3',NULL,NULL,NULL),(350,'24721',NULL,1,NULL,'نگارش3',NULL,NULL,NULL),(351,'88701',NULL,2,NULL,'زیست شناسی کاردانش',NULL,NULL,NULL),(352,'1111',NULL,4,NULL,'مهارت',NULL,NULL,NULL),(371,'14021',NULL,2,NULL,'کارگاه فناوری',NULL,NULL,NULL);
/*!40000 ALTER TABLE `reg_course` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_course_field`
--

LOCK TABLES `reg_course_field` WRITE;
/*!40000 ALTER TABLE `reg_course_field` DISABLE KEYS */;
INSERT INTO `reg_course_field` VALUES (141,1,218,_binary '\0',2),(143,3,218,_binary '\0',2),(150,1,219,_binary '\0',1),(151,3,219,_binary '\0',1),(173,1,238,_binary '\0',2),(174,3,238,_binary '\0',2),(175,2,238,_binary '\0',2),(177,1,239,_binary '\0',2),(178,3,239,_binary '\0',2),(182,3,220,_binary '\0',4),(183,1,220,_binary '\0',4),(184,1,221,_binary '\0',2),(188,2,222,_binary '\0',2),(189,3,222,_binary '\0',2),(193,1,222,_binary '\0',2),(196,3,223,_binary '\0',3),(197,1,223,_binary '\0',3),(198,2,223,_binary '\0',3),(211,1,293,_binary '\0',2),(215,2,293,_binary '\0',2),(216,3,293,_binary '\0',2),(218,1,224,_binary '\0',4),(219,3,225,_binary '\0',3),(220,1,225,_binary '\0',3),(221,1,289,_binary '\0',2),(222,3,289,_binary '\0',2),(225,2,227,_binary '\0',2),(228,3,227,_binary '\0',2),(233,1,227,_binary '\0',2),(234,3,228,_binary '\0',3),(235,2,261,_binary '\0',3),(236,2,229,_binary '\0',2),(237,2,230,_binary '\0',2),(238,2,231,_binary '\0',3),(239,2,232,_binary '\0',3),(246,2,233,_binary '\0',2),(256,2,234,_binary '\0',2),(258,2,235,_binary '\0',2),(259,3,236,_binary '\0',3),(267,1,267,_binary '\0',2),(269,3,267,_binary '\0',2),(270,1,253,_binary '\0',2),(271,3,253,_binary '\0',2),(283,1,244,_binary '\0',2),(284,3,244,_binary '\0',2),(285,2,244,_binary '\0',2),(291,1,256,_binary '\0',1),(292,3,256,_binary '\0',1),(293,1,265,_binary '\0',2),(294,1,270,_binary '\0',3),(295,1,271,_binary '\0',2),(296,1,249,_binary '\0',3),(297,2,249,_binary '\0',3),(298,3,249,_binary '\0',3),(314,2,294,_binary '\0',2),(315,3,294,_binary '\0',2),(316,1,294,_binary '\0',2),(318,1,269,_binary '\0',4),(319,1,268,_binary '\0',3),(320,3,268,_binary '\0',3),(321,3,226,_binary '\0',1),(322,1,226,_binary '\0',1),(324,1,248,_binary '\0',2),(326,2,248,_binary '\0',2),(327,3,248,_binary '\0',2),(335,3,255,_binary '\0',2),(340,1,255,_binary '\0',2),(344,3,259,_binary '\0',2),(345,1,259,_binary '\0',2),(346,3,287,_binary '\0',4),(347,3,274,_binary '\0',4),(349,2,252,_binary '\0',2),(350,2,257,_binary '\0',2),(351,2,250,_binary '\0',2),(352,2,264,_binary '\0',3),(353,2,254,_binary '\0',3),(354,2,245,_binary '\0',3),(355,2,260,_binary '\0',2),(356,2,258,_binary '\0',2),(357,3,290,_binary '\0',3),(358,1,279,_binary '',2),(359,3,279,_binary '',2),(368,1,321,_binary '',2),(369,3,321,_binary '',2),(378,1,278,_binary '',2),(379,3,278,_binary '',2),(380,2,278,_binary '',2),(389,2,286,_binary '\0',2),(390,3,286,_binary '\0',2),(391,1,286,_binary '\0',2),(392,1,323,_binary '',2),(393,1,324,_binary '',3),(394,1,325,_binary '',2),(395,2,326,_binary '',4),(396,3,326,_binary '',4),(397,1,326,_binary '',4),(399,2,295,_binary '\0',2),(406,3,295,_binary '\0',2),(407,1,295,_binary '\0',2),(409,1,328,_binary '',4),(410,3,329,_binary '',4),(411,1,329,_binary '',4),(412,2,276,_binary '',2),(413,3,276,_binary '',2),(414,1,276,_binary '',2),(431,1,275,_binary '\0',2),(432,3,275,_binary '\0',2),(433,2,275,_binary '\0',2),(434,3,281,_binary '',2),(435,1,281,_binary '',2),(444,3,333,_binary '',4),(445,3,334,_binary '',4),(446,2,336,_binary '',4),(447,2,337,_binary '',2),(448,2,338,_binary '',2),(449,2,339,_binary '',2),(450,2,340,_binary '',2),(451,2,341,_binary '',2),(452,2,342,_binary '',3),(453,2,291,_binary '\0',2),(454,2,344,_binary '',2),(455,3,335,_binary '',3),(462,1,266,_binary '\0',2),(463,3,266,_binary '\0',2),(464,2,266,_binary '\0',2),(523,4,207,_binary '\0',2),(524,4,155,_binary '\0',2),(526,4,120,_binary '\0',1),(528,4,189,_binary '\0',2),(529,4,172,_binary '\0',2),(530,4,196,_binary '\0',3),(531,4,163,_binary '\0',4),(532,4,299,_binary '\0',2),(533,4,111,_binary '\0',3),(534,4,300,_binary '\0',2),(535,4,301,_binary '\0',2),(536,4,140,_binary '\0',2),(537,4,209,_binary '\0',2),(538,4,157,_binary '\0',2),(540,4,122,_binary '\0',1),(542,4,191,_binary '\0',2),(543,4,175,_binary '\0',2),(544,4,198,_binary '\0',3),(545,4,166,_binary '\0',4),(546,4,315,_binary '\0',2),(548,4,113,_binary '\0',3),(549,4,316,_binary '\0',2),(550,4,317,_binary '\0',2),(551,4,141,_binary '\0',2),(552,4,211,_binary '\0',2),(553,4,158,_binary '\0',2),(555,4,123,_binary '\0',1),(557,4,194,_binary '\0',2),(558,4,177,_binary '\0',2),(559,4,200,_binary '\0',3),(560,4,167,_binary '\0',4),(561,4,303,_binary '\0',2),(562,4,115,_binary '\0',3),(563,4,304,_binary '\0',2),(564,4,305,_binary '\0',2),(565,4,131,_binary '\0',2),(566,2,246,_binary '\0',4),(567,2,239,_binary '\0',2),(568,2,256,_binary '\0',2),(724,4,345,_binary '\0',2),(725,4,346,_binary '\0',1),(726,4,347,_binary '\0',2),(727,4,348,_binary '\0',1),(728,4,349,_binary '\0',2),(729,4,350,_binary '\0',1),(967,3,371,_binary '\0',2),(1214,5,218,_binary '\0',0),(1215,5,222,_binary '\0',0),(1216,5,227,_binary '\0',0),(1217,5,233,_binary '\0',0),(1218,5,234,_binary '\0',0),(1219,5,238,_binary '\0',0),(1220,5,241,_binary '\0',0),(1221,5,242,_binary '\0',0),(1222,5,243,_binary '\0',0),(1223,5,244,_binary '\0',0),(1224,5,248,_binary '\0',0),(1225,5,255,_binary '\0',0),(1226,5,262,_binary '\0',0),(1227,5,263,_binary '\0',0),(1228,5,266,_binary '\0',0),(1229,5,267,_binary '\0',0),(1230,5,275,_binary '\0',0),(1231,5,276,_binary '\0',0),(1232,5,277,_binary '\0',0),(1233,5,278,_binary '\0',0),(1234,5,279,_binary '\0',0),(1235,5,280,_binary '\0',0),(1236,5,281,_binary '\0',0),(1237,5,282,_binary '\0',0),(1238,5,283,_binary '\0',0),(1239,5,288,_binary '\0',0),(1240,5,292,_binary '\0',0),(1241,5,293,_binary '\0',0),(1242,5,294,_binary '\0',0),(1243,5,295,_binary '\0',0),(1244,5,297,_binary '\0',0),(1245,5,352,_binary '\0',0),(1246,6,218,_binary '\0',0),(1247,6,222,_binary '\0',0),(1248,6,227,_binary '\0',0),(1249,6,233,_binary '\0',0),(1250,6,234,_binary '\0',0),(1251,6,238,_binary '\0',0),(1252,6,241,_binary '\0',0),(1253,6,242,_binary '\0',0),(1254,6,243,_binary '\0',0),(1255,6,244,_binary '\0',0),(1256,6,248,_binary '\0',0),(1257,6,255,_binary '\0',0),(1258,6,262,_binary '\0',0),(1259,6,263,_binary '\0',0),(1260,6,266,_binary '\0',0),(1261,6,267,_binary '\0',0),(1262,6,275,_binary '\0',0),(1263,6,276,_binary '\0',0),(1264,6,277,_binary '\0',0),(1265,6,278,_binary '\0',0),(1266,6,279,_binary '\0',0),(1267,6,280,_binary '\0',0),(1268,6,281,_binary '\0',0),(1269,6,282,_binary '\0',0),(1270,6,283,_binary '\0',0),(1271,6,288,_binary '\0',0),(1272,6,292,_binary '\0',0),(1273,6,293,_binary '\0',0),(1274,6,294,_binary '\0',0),(1275,6,295,_binary '\0',0),(1276,6,297,_binary '\0',0),(1277,6,352,_binary '\0',0),(1278,7,218,_binary '\0',0),(1279,7,222,_binary '\0',0),(1280,7,227,_binary '\0',0),(1281,7,233,_binary '\0',0),(1282,7,234,_binary '\0',0),(1283,7,238,_binary '\0',0),(1284,7,241,_binary '\0',0),(1285,7,242,_binary '\0',0),(1286,7,243,_binary '\0',0),(1287,7,244,_binary '\0',0),(1288,7,248,_binary '\0',0),(1289,7,255,_binary '\0',0),(1290,7,262,_binary '\0',0),(1291,7,263,_binary '\0',0),(1292,7,266,_binary '\0',0),(1293,7,267,_binary '\0',0),(1294,7,275,_binary '\0',0),(1295,7,276,_binary '\0',0),(1296,7,277,_binary '\0',0),(1297,7,278,_binary '\0',0),(1298,7,279,_binary '\0',0),(1299,7,280,_binary '\0',0),(1300,7,281,_binary '\0',0),(1301,7,282,_binary '\0',0),(1302,7,283,_binary '\0',0),(1303,7,288,_binary '\0',0),(1304,7,292,_binary '\0',0),(1305,7,293,_binary '\0',0),(1306,7,294,_binary '\0',0),(1307,7,295,_binary '\0',0),(1308,7,297,_binary '\0',0),(1309,7,352,_binary '\0',0),(1310,8,218,_binary '\0',0),(1311,8,222,_binary '\0',0),(1312,8,227,_binary '\0',0),(1313,8,233,_binary '\0',0),(1314,8,234,_binary '\0',0),(1315,8,238,_binary '\0',0),(1316,8,241,_binary '\0',0),(1317,8,242,_binary '\0',0),(1318,8,243,_binary '\0',0),(1319,8,244,_binary '\0',0),(1320,8,248,_binary '\0',0),(1321,8,255,_binary '\0',0),(1322,8,262,_binary '\0',0),(1323,8,263,_binary '\0',0),(1324,8,266,_binary '\0',0),(1325,8,267,_binary '\0',0),(1326,8,275,_binary '\0',0),(1327,8,276,_binary '\0',0),(1328,8,277,_binary '\0',0),(1329,8,278,_binary '\0',0),(1330,8,279,_binary '\0',0),(1331,8,280,_binary '\0',0),(1332,8,281,_binary '\0',0),(1333,8,282,_binary '\0',0),(1334,8,283,_binary '\0',0),(1335,8,288,_binary '\0',0),(1336,8,292,_binary '\0',0),(1337,8,293,_binary '\0',0),(1338,8,294,_binary '\0',0),(1339,8,295,_binary '\0',0),(1340,8,297,_binary '\0',0),(1341,8,352,_binary '\0',0),(1342,9,218,_binary '\0',0),(1343,9,222,_binary '\0',0),(1344,9,227,_binary '\0',0),(1345,9,233,_binary '\0',0),(1346,9,234,_binary '\0',0),(1347,9,238,_binary '\0',0),(1348,9,241,_binary '\0',0),(1349,9,242,_binary '\0',0),(1350,9,243,_binary '\0',0),(1351,9,244,_binary '\0',0),(1352,9,248,_binary '\0',0),(1353,9,255,_binary '\0',0),(1354,9,262,_binary '\0',0),(1355,9,263,_binary '\0',0),(1356,9,266,_binary '\0',0),(1357,9,267,_binary '\0',0),(1358,9,275,_binary '\0',0),(1359,9,276,_binary '\0',0),(1360,9,277,_binary '\0',0),(1361,9,278,_binary '\0',0),(1362,9,279,_binary '\0',0),(1363,9,280,_binary '\0',0),(1364,9,281,_binary '\0',0),(1365,9,282,_binary '\0',0),(1366,9,283,_binary '\0',0),(1367,9,288,_binary '\0',0),(1368,9,292,_binary '\0',0),(1369,9,293,_binary '\0',0),(1370,9,294,_binary '\0',0),(1371,9,295,_binary '\0',0),(1372,9,297,_binary '\0',0),(1373,9,352,_binary '\0',0),(1374,12,218,_binary '\0',0),(1375,12,222,_binary '\0',0),(1376,12,227,_binary '\0',0),(1377,12,233,_binary '\0',0),(1378,12,234,_binary '\0',0),(1379,12,238,_binary '\0',0),(1380,12,241,_binary '\0',0),(1381,12,242,_binary '\0',0),(1382,12,243,_binary '\0',0),(1383,12,244,_binary '\0',0),(1384,12,248,_binary '\0',0),(1385,12,255,_binary '\0',0),(1386,12,262,_binary '\0',0),(1387,12,263,_binary '\0',0),(1388,12,266,_binary '\0',0),(1389,12,267,_binary '\0',0),(1390,12,275,_binary '\0',0),(1391,12,276,_binary '\0',0),(1392,12,277,_binary '\0',0),(1393,12,278,_binary '\0',0),(1394,12,279,_binary '\0',0),(1395,12,280,_binary '\0',0),(1396,12,281,_binary '\0',0),(1397,12,282,_binary '\0',0),(1398,12,283,_binary '\0',0),(1399,12,288,_binary '\0',0),(1400,12,292,_binary '\0',0),(1401,12,293,_binary '\0',0),(1402,12,294,_binary '\0',0),(1403,12,295,_binary '\0',0),(1404,12,297,_binary '\0',0),(1405,12,352,_binary '\0',0),(1406,13,218,_binary '\0',0),(1407,13,222,_binary '\0',0),(1408,13,227,_binary '\0',0),(1409,13,233,_binary '\0',0),(1410,13,234,_binary '\0',0),(1411,13,238,_binary '\0',0),(1412,13,241,_binary '\0',0),(1413,13,242,_binary '\0',0),(1414,13,243,_binary '\0',0),(1415,13,244,_binary '\0',0),(1416,13,248,_binary '\0',0),(1417,13,255,_binary '\0',0),(1418,13,262,_binary '\0',0),(1419,13,263,_binary '\0',0),(1420,13,266,_binary '\0',0),(1421,13,267,_binary '\0',0),(1422,13,275,_binary '\0',0),(1423,13,276,_binary '\0',0),(1424,13,277,_binary '\0',0),(1425,13,278,_binary '\0',0),(1426,13,279,_binary '\0',0),(1427,13,280,_binary '\0',0),(1428,13,281,_binary '\0',0),(1429,13,282,_binary '\0',0),(1430,13,283,_binary '\0',0),(1431,13,288,_binary '\0',0),(1432,13,292,_binary '\0',0),(1433,13,293,_binary '\0',0),(1434,13,294,_binary '\0',0),(1435,13,295,_binary '\0',0),(1436,13,297,_binary '\0',0),(1437,13,352,_binary '\0',0),(1438,14,218,_binary '\0',0),(1439,14,222,_binary '\0',0),(1440,14,227,_binary '\0',0),(1441,14,233,_binary '\0',0),(1442,14,234,_binary '\0',0),(1443,14,238,_binary '\0',0),(1444,14,241,_binary '\0',0),(1445,14,242,_binary '\0',0),(1446,14,243,_binary '\0',0),(1447,14,244,_binary '\0',0),(1448,14,248,_binary '\0',0),(1449,14,255,_binary '\0',0),(1450,14,262,_binary '\0',0),(1451,14,263,_binary '\0',0),(1452,14,266,_binary '\0',0),(1453,14,267,_binary '\0',0),(1454,14,275,_binary '\0',0),(1455,14,276,_binary '\0',0),(1456,14,277,_binary '\0',0),(1457,14,278,_binary '\0',0),(1458,14,279,_binary '\0',0),(1459,14,280,_binary '\0',0),(1460,14,281,_binary '\0',0),(1461,14,282,_binary '\0',0),(1462,14,283,_binary '\0',0),(1463,14,288,_binary '\0',0),(1464,14,292,_binary '\0',0),(1465,14,293,_binary '\0',0),(1466,14,294,_binary '\0',0),(1467,14,295,_binary '\0',0),(1468,14,297,_binary '\0',0),(1469,14,352,_binary '\0',0),(1470,15,218,_binary '\0',0),(1471,15,222,_binary '\0',0),(1472,15,227,_binary '\0',0),(1473,15,233,_binary '\0',0),(1474,15,234,_binary '\0',0),(1475,15,238,_binary '\0',0),(1476,15,241,_binary '\0',0),(1477,15,242,_binary '\0',0),(1478,15,243,_binary '\0',0),(1479,15,244,_binary '\0',0),(1480,15,248,_binary '\0',0),(1481,15,255,_binary '\0',0),(1482,15,262,_binary '\0',0),(1483,15,263,_binary '\0',0),(1484,15,266,_binary '\0',0),(1485,15,267,_binary '\0',0),(1486,15,275,_binary '\0',0),(1487,15,276,_binary '\0',0),(1488,15,277,_binary '\0',0),(1489,15,278,_binary '\0',0),(1490,15,279,_binary '\0',0),(1491,15,280,_binary '\0',0),(1492,15,281,_binary '\0',0),(1493,15,282,_binary '\0',0),(1494,15,283,_binary '\0',0),(1495,15,288,_binary '\0',0),(1496,15,292,_binary '\0',0),(1497,15,293,_binary '\0',0),(1498,15,294,_binary '\0',0),(1499,15,295,_binary '\0',0),(1500,15,297,_binary '\0',0),(1501,15,352,_binary '\0',0),(1502,16,218,_binary '\0',0),(1503,16,222,_binary '\0',0),(1504,16,227,_binary '\0',0),(1505,16,233,_binary '\0',0),(1506,16,234,_binary '\0',0),(1507,16,238,_binary '\0',0),(1508,16,241,_binary '\0',0),(1509,16,242,_binary '\0',0),(1510,16,243,_binary '\0',0),(1511,16,244,_binary '\0',0),(1512,16,248,_binary '\0',0),(1513,16,255,_binary '\0',0),(1514,16,262,_binary '\0',0),(1515,16,263,_binary '\0',0),(1516,16,266,_binary '\0',0),(1517,16,267,_binary '\0',0),(1518,16,275,_binary '\0',0),(1519,16,276,_binary '\0',0),(1520,16,277,_binary '\0',0),(1521,16,278,_binary '\0',0),(1522,16,279,_binary '\0',0),(1523,16,280,_binary '\0',0),(1524,16,281,_binary '\0',0),(1525,16,282,_binary '\0',0),(1526,16,283,_binary '\0',0),(1527,16,288,_binary '\0',0),(1528,16,292,_binary '\0',0),(1529,16,293,_binary '\0',0),(1530,16,294,_binary '\0',0),(1531,16,295,_binary '\0',0),(1532,16,297,_binary '\0',0),(1533,16,352,_binary '\0',0),(1534,18,218,_binary '\0',0),(1535,18,222,_binary '\0',0),(1536,18,227,_binary '\0',0),(1537,18,233,_binary '\0',0),(1538,18,234,_binary '\0',0),(1539,18,238,_binary '\0',0),(1540,18,241,_binary '\0',0),(1541,18,242,_binary '\0',0),(1542,18,243,_binary '\0',0),(1543,18,244,_binary '\0',0),(1544,18,248,_binary '\0',0),(1545,18,255,_binary '\0',0),(1546,18,262,_binary '\0',0),(1547,18,263,_binary '\0',0),(1548,18,266,_binary '\0',0),(1549,18,267,_binary '\0',0),(1550,18,275,_binary '\0',0),(1551,18,276,_binary '\0',0),(1552,18,277,_binary '\0',0),(1553,18,278,_binary '\0',0),(1554,18,279,_binary '\0',0),(1555,18,280,_binary '\0',0),(1556,18,281,_binary '\0',0),(1557,18,282,_binary '\0',0),(1558,18,283,_binary '\0',0),(1559,18,288,_binary '\0',0),(1560,18,292,_binary '\0',0),(1561,18,293,_binary '\0',0),(1562,18,294,_binary '\0',0),(1563,18,295,_binary '\0',0),(1564,18,297,_binary '\0',0),(1565,18,352,_binary '\0',0),(1566,19,218,_binary '\0',0),(1567,19,222,_binary '\0',0),(1568,19,227,_binary '\0',0),(1569,19,233,_binary '\0',0),(1570,19,234,_binary '\0',0),(1571,19,238,_binary '\0',0),(1572,19,241,_binary '\0',0),(1573,19,242,_binary '\0',0),(1574,19,243,_binary '\0',0),(1575,19,244,_binary '\0',0),(1576,19,248,_binary '\0',0),(1577,19,255,_binary '\0',0),(1578,19,262,_binary '\0',0),(1579,19,263,_binary '\0',0),(1580,19,266,_binary '\0',0),(1581,19,267,_binary '\0',0),(1582,19,275,_binary '\0',0),(1583,19,276,_binary '\0',0),(1584,19,277,_binary '\0',0),(1585,19,278,_binary '\0',0),(1586,19,279,_binary '\0',0),(1587,19,280,_binary '\0',0),(1588,19,281,_binary '\0',0),(1589,19,282,_binary '\0',0),(1590,19,283,_binary '\0',0),(1591,19,288,_binary '\0',0),(1592,19,292,_binary '\0',0),(1593,19,293,_binary '\0',0),(1594,19,294,_binary '\0',0),(1595,19,295,_binary '\0',0),(1596,19,297,_binary '\0',0),(1597,19,352,_binary '\0',0),(1598,20,218,_binary '\0',0),(1599,20,222,_binary '\0',0),(1600,20,227,_binary '\0',0),(1601,20,233,_binary '\0',0),(1602,20,234,_binary '\0',0),(1603,20,238,_binary '\0',0),(1604,20,241,_binary '\0',0),(1605,20,242,_binary '\0',0),(1606,20,243,_binary '\0',0),(1607,20,244,_binary '\0',0),(1608,20,248,_binary '\0',0),(1609,20,255,_binary '\0',0),(1610,20,262,_binary '\0',0),(1611,20,263,_binary '\0',0),(1612,20,266,_binary '\0',0),(1613,20,267,_binary '\0',0),(1614,20,275,_binary '\0',0),(1615,20,276,_binary '\0',0),(1616,20,277,_binary '\0',0),(1617,20,278,_binary '\0',0),(1618,20,279,_binary '\0',0),(1619,20,280,_binary '\0',0),(1620,20,281,_binary '\0',0),(1621,20,282,_binary '\0',0),(1622,20,283,_binary '\0',0),(1623,20,288,_binary '\0',0),(1624,20,292,_binary '\0',0),(1625,20,293,_binary '\0',0),(1626,20,294,_binary '\0',0),(1627,20,295,_binary '\0',0),(1628,20,297,_binary '\0',0),(1629,20,352,_binary '\0',0),(1630,23,218,_binary '\0',0),(1631,23,222,_binary '\0',0),(1632,23,227,_binary '\0',0),(1633,23,233,_binary '\0',0),(1634,23,234,_binary '\0',0),(1635,23,238,_binary '\0',0),(1636,23,241,_binary '\0',0),(1637,23,242,_binary '\0',0),(1638,23,243,_binary '\0',0),(1639,23,244,_binary '\0',0),(1640,23,248,_binary '\0',0),(1641,23,255,_binary '\0',0),(1642,23,262,_binary '\0',0),(1643,23,263,_binary '\0',0),(1644,23,266,_binary '\0',0),(1645,23,267,_binary '\0',0),(1646,23,275,_binary '\0',0),(1647,23,276,_binary '\0',0),(1648,23,277,_binary '\0',0),(1649,23,278,_binary '\0',0),(1650,23,279,_binary '\0',0),(1651,23,280,_binary '\0',0),(1652,23,281,_binary '\0',0),(1653,23,282,_binary '\0',0),(1654,23,283,_binary '\0',0),(1655,23,288,_binary '\0',0),(1656,23,292,_binary '\0',0),(1657,23,293,_binary '\0',0),(1658,23,294,_binary '\0',0),(1659,23,295,_binary '\0',0),(1660,23,297,_binary '\0',0),(1661,23,352,_binary '\0',0),(1662,24,218,_binary '\0',0),(1663,24,222,_binary '\0',0),(1664,24,227,_binary '\0',0),(1665,24,233,_binary '\0',0),(1666,24,234,_binary '\0',0),(1667,24,238,_binary '\0',0),(1668,24,241,_binary '\0',0),(1669,24,242,_binary '\0',0),(1670,24,243,_binary '\0',0),(1671,24,244,_binary '\0',0),(1672,24,248,_binary '\0',0),(1673,24,255,_binary '\0',0),(1674,24,262,_binary '\0',0),(1675,24,263,_binary '\0',0),(1676,24,266,_binary '\0',0),(1677,24,267,_binary '\0',0),(1678,24,275,_binary '\0',0),(1679,24,276,_binary '\0',0),(1680,24,277,_binary '\0',0),(1681,24,278,_binary '\0',0),(1682,24,279,_binary '\0',0),(1683,24,280,_binary '\0',0),(1684,24,281,_binary '\0',0),(1685,24,282,_binary '\0',0),(1686,24,283,_binary '\0',0),(1687,24,288,_binary '\0',0),(1688,24,292,_binary '\0',0),(1689,24,293,_binary '\0',0),(1690,24,294,_binary '\0',0),(1691,24,295,_binary '\0',0),(1692,24,297,_binary '\0',0),(1693,24,352,_binary '\0',0),(1694,25,218,_binary '\0',0),(1695,25,222,_binary '\0',0),(1696,25,227,_binary '\0',0),(1697,25,233,_binary '\0',0),(1698,25,234,_binary '\0',0),(1699,25,238,_binary '\0',0),(1700,25,241,_binary '\0',0),(1701,25,242,_binary '\0',0),(1702,25,243,_binary '\0',0),(1703,25,244,_binary '\0',0),(1704,25,248,_binary '\0',0),(1705,25,255,_binary '\0',0),(1706,25,262,_binary '\0',0),(1707,25,263,_binary '\0',0),(1708,25,266,_binary '\0',0),(1709,25,267,_binary '\0',0),(1710,25,275,_binary '\0',0),(1711,25,276,_binary '\0',0),(1712,25,277,_binary '\0',0),(1713,25,278,_binary '\0',0),(1714,25,279,_binary '\0',0),(1715,25,280,_binary '\0',0),(1716,25,281,_binary '\0',0),(1717,25,282,_binary '\0',0),(1718,25,283,_binary '\0',0),(1719,25,288,_binary '\0',0),(1720,25,292,_binary '\0',0),(1721,25,293,_binary '\0',0),(1722,25,294,_binary '\0',0),(1723,25,295,_binary '\0',0),(1724,25,297,_binary '\0',0),(1725,25,352,_binary '\0',0),(1726,26,218,_binary '\0',0),(1727,26,222,_binary '\0',0),(1728,26,227,_binary '\0',0),(1729,26,233,_binary '\0',0),(1730,26,234,_binary '\0',0),(1731,26,238,_binary '\0',0),(1732,26,241,_binary '\0',0),(1733,26,242,_binary '\0',0),(1734,26,243,_binary '\0',0),(1735,26,244,_binary '\0',0),(1736,26,248,_binary '\0',0),(1737,26,255,_binary '\0',0),(1738,26,262,_binary '\0',0),(1739,26,263,_binary '\0',0),(1740,26,266,_binary '\0',0),(1741,26,267,_binary '\0',0),(1742,26,275,_binary '\0',0),(1743,26,276,_binary '\0',0),(1744,26,277,_binary '\0',0),(1745,26,278,_binary '\0',0),(1746,26,279,_binary '\0',0),(1747,26,280,_binary '\0',0),(1748,26,281,_binary '\0',0),(1749,26,282,_binary '\0',0),(1750,26,283,_binary '\0',0),(1751,26,288,_binary '\0',0),(1752,26,292,_binary '\0',0),(1753,26,293,_binary '\0',0),(1754,26,294,_binary '\0',0),(1755,26,295,_binary '\0',0),(1756,26,297,_binary '\0',0),(1757,26,352,_binary '\0',0),(1758,27,218,_binary '\0',0),(1759,27,222,_binary '\0',0),(1760,27,227,_binary '\0',0),(1761,27,233,_binary '\0',0),(1762,27,234,_binary '\0',0),(1763,27,238,_binary '\0',0),(1764,27,241,_binary '\0',0),(1765,27,242,_binary '\0',0),(1766,27,243,_binary '\0',0),(1767,27,244,_binary '\0',0),(1768,27,248,_binary '\0',0),(1769,27,255,_binary '\0',0),(1770,27,262,_binary '\0',0),(1771,27,263,_binary '\0',0),(1772,27,266,_binary '\0',0),(1773,27,267,_binary '\0',0),(1774,27,275,_binary '\0',0),(1775,27,276,_binary '\0',0),(1776,27,277,_binary '\0',0),(1777,27,278,_binary '\0',0),(1778,27,279,_binary '\0',0),(1779,27,280,_binary '\0',0),(1780,27,281,_binary '\0',0),(1781,27,282,_binary '\0',0),(1782,27,283,_binary '\0',0),(1783,27,288,_binary '\0',0),(1784,27,292,_binary '\0',0),(1785,27,293,_binary '\0',0),(1786,27,294,_binary '\0',0),(1787,27,295,_binary '\0',0),(1788,27,297,_binary '\0',0),(1789,27,352,_binary '\0',0),(1790,28,218,_binary '\0',0),(1791,28,222,_binary '\0',0),(1792,28,227,_binary '\0',0),(1793,28,233,_binary '\0',0),(1794,28,234,_binary '\0',0),(1795,28,238,_binary '\0',0),(1796,28,241,_binary '\0',0),(1797,28,242,_binary '\0',0),(1798,28,243,_binary '\0',0),(1799,28,244,_binary '\0',0),(1800,28,248,_binary '\0',0),(1801,28,255,_binary '\0',0),(1802,28,262,_binary '\0',0),(1803,28,263,_binary '\0',0),(1804,28,266,_binary '\0',0),(1805,28,267,_binary '\0',0),(1806,28,275,_binary '\0',0),(1807,28,276,_binary '\0',0),(1808,28,277,_binary '\0',0),(1809,28,278,_binary '\0',0),(1810,28,279,_binary '\0',0),(1811,28,280,_binary '\0',0),(1812,28,281,_binary '\0',0),(1813,28,282,_binary '\0',0),(1814,28,283,_binary '\0',0),(1815,28,288,_binary '\0',0),(1816,28,292,_binary '\0',0),(1817,28,293,_binary '\0',0),(1818,28,294,_binary '\0',0),(1819,28,295,_binary '\0',0),(1820,28,297,_binary '\0',0),(1821,28,352,_binary '\0',0),(1822,29,218,_binary '\0',0),(1823,29,222,_binary '\0',0),(1824,29,227,_binary '\0',0),(1825,29,233,_binary '\0',0),(1826,29,234,_binary '\0',0),(1827,29,238,_binary '\0',0),(1828,29,241,_binary '\0',0),(1829,29,242,_binary '\0',0),(1830,29,243,_binary '\0',0),(1831,29,244,_binary '\0',0),(1832,29,248,_binary '\0',0),(1833,29,255,_binary '\0',0),(1834,29,262,_binary '\0',0),(1835,29,263,_binary '\0',0),(1836,29,266,_binary '\0',0),(1837,29,267,_binary '\0',0),(1838,29,275,_binary '\0',0),(1839,29,276,_binary '\0',0),(1840,29,277,_binary '\0',0),(1841,29,278,_binary '\0',0),(1842,29,279,_binary '\0',0),(1843,29,280,_binary '\0',0),(1844,29,281,_binary '\0',0),(1845,29,282,_binary '\0',0),(1846,29,283,_binary '\0',0),(1847,29,288,_binary '\0',0),(1848,29,292,_binary '\0',0),(1849,29,293,_binary '\0',0),(1850,29,294,_binary '\0',0),(1851,29,295,_binary '\0',0),(1852,29,297,_binary '\0',0),(1853,29,352,_binary '\0',0),(1854,30,218,_binary '\0',0),(1855,30,222,_binary '\0',0),(1856,30,227,_binary '\0',0),(1857,30,233,_binary '\0',0),(1858,30,234,_binary '\0',0),(1859,30,238,_binary '\0',0),(1860,30,241,_binary '\0',0),(1861,30,242,_binary '\0',0),(1862,30,243,_binary '\0',0),(1863,30,244,_binary '\0',0),(1864,30,248,_binary '\0',0),(1865,30,255,_binary '\0',0),(1866,30,262,_binary '\0',0),(1867,30,263,_binary '\0',0),(1868,30,266,_binary '\0',0),(1869,30,267,_binary '\0',0),(1870,30,275,_binary '\0',0),(1871,30,276,_binary '\0',0),(1872,30,277,_binary '\0',0),(1873,30,278,_binary '\0',0),(1874,30,279,_binary '\0',0),(1875,30,280,_binary '\0',0),(1876,30,281,_binary '\0',0),(1877,30,282,_binary '\0',0),(1878,30,283,_binary '\0',0),(1879,30,288,_binary '\0',0),(1880,30,292,_binary '\0',0),(1881,30,293,_binary '\0',0),(1882,30,294,_binary '\0',0),(1883,30,295,_binary '\0',0),(1884,30,297,_binary '\0',0),(1885,30,352,_binary '\0',0),(1886,31,218,_binary '\0',0),(1887,31,222,_binary '\0',0),(1888,31,227,_binary '\0',0),(1889,31,233,_binary '\0',0),(1890,31,234,_binary '\0',0),(1891,31,238,_binary '\0',0),(1892,31,241,_binary '\0',0),(1893,31,242,_binary '\0',0),(1894,31,243,_binary '\0',0),(1895,31,244,_binary '\0',0),(1896,31,248,_binary '\0',0),(1897,31,255,_binary '\0',0),(1898,31,262,_binary '\0',0),(1899,31,263,_binary '\0',0),(1900,31,266,_binary '\0',0),(1901,31,267,_binary '\0',0),(1902,31,275,_binary '\0',0),(1903,31,276,_binary '\0',0),(1904,31,277,_binary '\0',0),(1905,31,278,_binary '\0',0),(1906,31,279,_binary '\0',0),(1907,31,280,_binary '\0',0),(1908,31,281,_binary '\0',0),(1909,31,282,_binary '\0',0),(1910,31,283,_binary '\0',0),(1911,31,288,_binary '\0',0),(1912,31,292,_binary '\0',0),(1913,31,293,_binary '\0',0),(1914,31,294,_binary '\0',0),(1915,31,295,_binary '\0',0),(1916,31,297,_binary '\0',0),(1917,31,352,_binary '\0',0),(1918,32,218,_binary '\0',0),(1919,32,222,_binary '\0',0),(1920,32,227,_binary '\0',0),(1921,32,233,_binary '\0',0),(1922,32,234,_binary '\0',0),(1923,32,238,_binary '\0',0),(1924,32,241,_binary '\0',0),(1925,32,242,_binary '\0',0),(1926,32,243,_binary '\0',0),(1927,32,244,_binary '\0',0),(1928,32,248,_binary '\0',0),(1929,32,255,_binary '\0',0),(1930,32,262,_binary '\0',0),(1931,32,263,_binary '\0',0),(1932,32,266,_binary '\0',0),(1933,32,267,_binary '\0',0),(1934,32,275,_binary '\0',0),(1935,32,276,_binary '\0',0),(1936,32,277,_binary '\0',0),(1937,32,278,_binary '\0',0),(1938,32,279,_binary '\0',0),(1939,32,280,_binary '\0',0),(1940,32,281,_binary '\0',0),(1941,32,282,_binary '\0',0),(1942,32,283,_binary '\0',0),(1943,32,288,_binary '\0',0),(1944,32,292,_binary '\0',0),(1945,32,293,_binary '\0',0),(1946,32,294,_binary '\0',0),(1947,32,295,_binary '\0',0),(1948,32,297,_binary '\0',0),(1949,32,352,_binary '\0',0),(1950,33,218,_binary '\0',0),(1951,33,222,_binary '\0',0),(1952,33,227,_binary '\0',0),(1953,33,233,_binary '\0',0),(1954,33,234,_binary '\0',0),(1955,33,238,_binary '\0',0),(1956,33,241,_binary '\0',0),(1957,33,242,_binary '\0',0),(1958,33,243,_binary '\0',0),(1959,33,244,_binary '\0',0),(1960,33,248,_binary '\0',0),(1961,33,255,_binary '\0',0),(1962,33,262,_binary '\0',0),(1963,33,263,_binary '\0',0),(1964,33,266,_binary '\0',0),(1965,33,267,_binary '\0',0),(1966,33,275,_binary '\0',0),(1967,33,276,_binary '\0',0),(1968,33,277,_binary '\0',0),(1969,33,278,_binary '\0',0),(1970,33,279,_binary '\0',0),(1971,33,280,_binary '\0',0),(1972,33,281,_binary '\0',0),(1973,33,282,_binary '\0',0),(1974,33,283,_binary '\0',0),(1975,33,288,_binary '\0',0),(1976,33,292,_binary '\0',0),(1977,33,293,_binary '\0',0),(1978,33,294,_binary '\0',0),(1979,33,295,_binary '\0',0),(1980,33,297,_binary '\0',0),(1981,33,352,_binary '\0',0),(1982,34,218,_binary '\0',0),(1983,34,222,_binary '\0',0),(1984,34,227,_binary '\0',0),(1985,34,233,_binary '\0',0),(1986,34,234,_binary '\0',0),(1987,34,238,_binary '\0',0),(1988,34,241,_binary '\0',0),(1989,34,242,_binary '\0',0),(1990,34,243,_binary '\0',0),(1991,34,244,_binary '\0',0),(1992,34,248,_binary '\0',0),(1993,34,255,_binary '\0',0),(1994,34,262,_binary '\0',0),(1995,34,263,_binary '\0',0),(1996,34,266,_binary '\0',0),(1997,34,267,_binary '\0',0),(1998,34,275,_binary '\0',0),(1999,34,276,_binary '\0',0),(2000,34,277,_binary '\0',0),(2001,34,278,_binary '\0',0),(2002,34,279,_binary '\0',0),(2003,34,280,_binary '\0',0),(2004,34,281,_binary '\0',0),(2005,34,282,_binary '\0',0),(2006,34,283,_binary '\0',0),(2007,34,288,_binary '\0',0),(2008,34,292,_binary '\0',0),(2009,34,293,_binary '\0',0),(2010,34,294,_binary '\0',0),(2011,34,295,_binary '\0',0),(2012,34,297,_binary '\0',0),(2013,34,352,_binary '\0',0),(2014,35,218,_binary '\0',0),(2015,35,222,_binary '\0',0),(2016,35,227,_binary '\0',0),(2017,35,233,_binary '\0',0),(2018,35,234,_binary '\0',0),(2019,35,238,_binary '\0',0),(2020,35,241,_binary '\0',0),(2021,35,242,_binary '\0',0),(2022,35,243,_binary '\0',0),(2023,35,244,_binary '\0',0),(2024,35,248,_binary '\0',0),(2025,35,255,_binary '\0',0),(2026,35,262,_binary '\0',0),(2027,35,263,_binary '\0',0),(2028,35,266,_binary '\0',0),(2029,35,267,_binary '\0',0),(2030,35,275,_binary '\0',0),(2031,35,276,_binary '\0',0),(2032,35,277,_binary '\0',0),(2033,35,278,_binary '\0',0),(2034,35,279,_binary '\0',0),(2035,35,280,_binary '\0',0),(2036,35,281,_binary '\0',0),(2037,35,282,_binary '\0',0),(2038,35,283,_binary '\0',0),(2039,35,288,_binary '\0',0),(2040,35,292,_binary '\0',0),(2041,35,293,_binary '\0',0),(2042,35,294,_binary '\0',0),(2043,35,295,_binary '\0',0),(2044,35,297,_binary '\0',0),(2045,35,352,_binary '\0',0),(2046,36,218,_binary '\0',0),(2047,36,222,_binary '\0',0),(2048,36,227,_binary '\0',0),(2049,36,233,_binary '\0',0),(2050,36,234,_binary '\0',0),(2051,36,238,_binary '\0',0),(2052,36,241,_binary '\0',0),(2053,36,242,_binary '\0',0),(2054,36,243,_binary '\0',0),(2055,36,244,_binary '\0',0),(2056,36,248,_binary '\0',0),(2057,36,255,_binary '\0',0),(2058,36,262,_binary '\0',0),(2059,36,263,_binary '\0',0),(2060,36,266,_binary '\0',0),(2061,36,267,_binary '\0',0),(2062,36,275,_binary '\0',0),(2063,36,276,_binary '\0',0),(2064,36,277,_binary '\0',0),(2065,36,278,_binary '\0',0),(2066,36,279,_binary '\0',0),(2067,36,280,_binary '\0',0),(2068,36,281,_binary '\0',0),(2069,36,282,_binary '\0',0),(2070,36,283,_binary '\0',0),(2071,36,288,_binary '\0',0),(2072,36,292,_binary '\0',0),(2073,36,293,_binary '\0',0),(2074,36,294,_binary '\0',0),(2075,36,295,_binary '\0',0),(2076,36,297,_binary '\0',0),(2077,36,352,_binary '\0',0),(2078,37,218,_binary '\0',0),(2079,37,222,_binary '\0',0),(2080,37,227,_binary '\0',0),(2081,37,233,_binary '\0',0),(2082,37,234,_binary '\0',0),(2083,37,238,_binary '\0',0),(2084,37,241,_binary '\0',0),(2085,37,242,_binary '\0',0),(2086,37,243,_binary '\0',0),(2087,37,244,_binary '\0',0),(2088,37,248,_binary '\0',0),(2089,37,255,_binary '\0',0),(2090,37,262,_binary '\0',0),(2091,37,263,_binary '\0',0),(2092,37,266,_binary '\0',0),(2093,37,267,_binary '\0',0),(2094,37,275,_binary '\0',0),(2095,37,276,_binary '\0',0),(2096,37,277,_binary '\0',0),(2097,37,278,_binary '\0',0),(2098,37,279,_binary '\0',0),(2099,37,280,_binary '\0',0),(2100,37,281,_binary '\0',0),(2101,37,282,_binary '\0',0),(2102,37,283,_binary '\0',0),(2103,37,288,_binary '\0',0),(2104,37,292,_binary '\0',0),(2105,37,293,_binary '\0',0),(2106,37,294,_binary '\0',0),(2107,37,295,_binary '\0',0),(2108,37,297,_binary '\0',0),(2109,37,352,_binary '\0',0),(2110,38,218,_binary '\0',0),(2111,38,222,_binary '\0',0),(2112,38,227,_binary '\0',0),(2113,38,233,_binary '\0',0),(2114,38,234,_binary '\0',0),(2115,38,238,_binary '\0',0),(2116,38,241,_binary '\0',0),(2117,38,242,_binary '\0',0),(2118,38,243,_binary '\0',0),(2119,38,244,_binary '\0',0),(2120,38,248,_binary '\0',0),(2121,38,255,_binary '\0',0),(2122,38,262,_binary '\0',0),(2123,38,263,_binary '\0',0),(2124,38,266,_binary '\0',0),(2125,38,267,_binary '\0',0),(2126,38,275,_binary '\0',0),(2127,38,276,_binary '\0',0),(2128,38,277,_binary '\0',0),(2129,38,278,_binary '\0',0),(2130,38,279,_binary '\0',0),(2131,38,280,_binary '\0',0),(2132,38,281,_binary '\0',0),(2133,38,282,_binary '\0',0),(2134,38,283,_binary '\0',0),(2135,38,288,_binary '\0',0),(2136,38,292,_binary '\0',0),(2137,38,293,_binary '\0',0),(2138,38,294,_binary '\0',0),(2139,38,295,_binary '\0',0),(2140,38,297,_binary '\0',0),(2141,38,352,_binary '\0',0),(2142,39,218,_binary '\0',0),(2143,39,222,_binary '\0',0),(2144,39,227,_binary '\0',0),(2145,39,233,_binary '\0',0),(2146,39,234,_binary '\0',0),(2147,39,238,_binary '\0',0),(2148,39,241,_binary '\0',0),(2149,39,242,_binary '\0',0),(2150,39,243,_binary '\0',0),(2151,39,244,_binary '\0',0),(2152,39,248,_binary '\0',0),(2153,39,255,_binary '\0',0),(2154,39,262,_binary '\0',0),(2155,39,263,_binary '\0',0),(2156,39,266,_binary '\0',0),(2157,39,267,_binary '\0',0),(2158,39,275,_binary '\0',0),(2159,39,276,_binary '\0',0),(2160,39,277,_binary '\0',0),(2161,39,278,_binary '\0',0),(2162,39,279,_binary '\0',0),(2163,39,280,_binary '\0',0),(2164,39,281,_binary '\0',0),(2165,39,282,_binary '\0',0),(2166,39,283,_binary '\0',0),(2167,39,288,_binary '\0',0),(2168,39,292,_binary '\0',0),(2169,39,293,_binary '\0',0),(2170,39,294,_binary '\0',0),(2171,39,295,_binary '\0',0),(2172,39,297,_binary '\0',0),(2173,39,352,_binary '\0',0),(2174,40,218,_binary '\0',0),(2175,40,222,_binary '\0',0),(2176,40,227,_binary '\0',0),(2177,40,233,_binary '\0',0),(2178,40,234,_binary '\0',0),(2179,40,238,_binary '\0',0),(2180,40,241,_binary '\0',0),(2181,40,242,_binary '\0',0),(2182,40,243,_binary '\0',0),(2183,40,244,_binary '\0',0),(2184,40,248,_binary '\0',0),(2185,40,255,_binary '\0',0),(2186,40,262,_binary '\0',0),(2187,40,263,_binary '\0',0),(2188,40,266,_binary '\0',0),(2189,40,267,_binary '\0',0),(2190,40,275,_binary '\0',0),(2191,40,276,_binary '\0',0),(2192,40,277,_binary '\0',0),(2193,40,278,_binary '\0',0),(2194,40,279,_binary '\0',0),(2195,40,280,_binary '\0',0),(2196,40,281,_binary '\0',0),(2197,40,282,_binary '\0',0),(2198,40,283,_binary '\0',0),(2199,40,288,_binary '\0',0),(2200,40,292,_binary '\0',0),(2201,40,293,_binary '\0',0),(2202,40,294,_binary '\0',0),(2203,40,295,_binary '\0',0),(2204,40,297,_binary '\0',0),(2205,40,352,_binary '\0',0),(2206,41,218,_binary '\0',0),(2207,41,222,_binary '\0',0),(2208,41,227,_binary '\0',0),(2209,41,233,_binary '\0',0),(2210,41,234,_binary '\0',0),(2211,41,238,_binary '\0',0),(2212,41,241,_binary '\0',0),(2213,41,242,_binary '\0',0),(2214,41,243,_binary '\0',0),(2215,41,244,_binary '\0',0),(2216,41,248,_binary '\0',0),(2217,41,255,_binary '\0',0),(2218,41,262,_binary '\0',0),(2219,41,263,_binary '\0',0),(2220,41,266,_binary '\0',0),(2221,41,267,_binary '\0',0),(2222,41,275,_binary '\0',0),(2223,41,276,_binary '\0',0),(2224,41,277,_binary '\0',0),(2225,41,278,_binary '\0',0),(2226,41,279,_binary '\0',0),(2227,41,280,_binary '\0',0),(2228,41,281,_binary '\0',0),(2229,41,282,_binary '\0',0),(2230,41,283,_binary '\0',0),(2231,41,288,_binary '\0',0),(2232,41,292,_binary '\0',0),(2233,41,293,_binary '\0',0),(2234,41,294,_binary '\0',0),(2235,41,295,_binary '\0',0),(2236,41,297,_binary '\0',0),(2237,41,352,_binary '\0',0),(2238,42,218,_binary '\0',0),(2239,42,222,_binary '\0',0),(2240,42,227,_binary '\0',0),(2241,42,233,_binary '\0',0),(2242,42,234,_binary '\0',0),(2243,42,238,_binary '\0',0),(2244,42,241,_binary '\0',0),(2245,42,242,_binary '\0',0),(2246,42,243,_binary '\0',0),(2247,42,244,_binary '\0',0),(2248,42,248,_binary '\0',0),(2249,42,255,_binary '\0',0),(2250,42,262,_binary '\0',0),(2251,42,263,_binary '\0',0),(2252,42,266,_binary '\0',0),(2253,42,267,_binary '\0',0),(2254,42,275,_binary '\0',0),(2255,42,276,_binary '\0',0),(2256,42,277,_binary '\0',0),(2257,42,278,_binary '\0',0),(2258,42,279,_binary '\0',0),(2259,42,280,_binary '\0',0),(2260,42,281,_binary '\0',0),(2261,42,282,_binary '\0',0),(2262,42,283,_binary '\0',0),(2263,42,288,_binary '\0',0),(2264,42,292,_binary '\0',0),(2265,42,293,_binary '\0',0),(2266,42,294,_binary '\0',0),(2267,42,295,_binary '\0',0),(2268,42,297,_binary '\0',0),(2269,42,352,_binary '\0',0),(2270,43,218,_binary '\0',0),(2271,43,222,_binary '\0',0),(2272,43,227,_binary '\0',0),(2273,43,233,_binary '\0',0),(2274,43,234,_binary '\0',0),(2275,43,238,_binary '\0',0),(2276,43,241,_binary '\0',0),(2277,43,242,_binary '\0',0),(2278,43,243,_binary '\0',0),(2279,43,244,_binary '\0',0),(2280,43,248,_binary '\0',0),(2281,43,255,_binary '\0',0),(2282,43,262,_binary '\0',0),(2283,43,263,_binary '\0',0),(2284,43,266,_binary '\0',0),(2285,43,267,_binary '\0',0),(2286,43,275,_binary '\0',0),(2287,43,276,_binary '\0',0),(2288,43,277,_binary '\0',0),(2289,43,278,_binary '\0',0),(2290,43,279,_binary '\0',0),(2291,43,280,_binary '\0',0),(2292,43,281,_binary '\0',0),(2293,43,282,_binary '\0',0),(2294,43,283,_binary '\0',0),(2295,43,288,_binary '\0',0),(2296,43,292,_binary '\0',0),(2297,43,293,_binary '\0',0),(2298,43,294,_binary '\0',0),(2299,43,295,_binary '\0',0),(2300,43,297,_binary '\0',0),(2301,43,352,_binary '\0',0),(2302,44,218,_binary '\0',0),(2303,44,222,_binary '\0',0),(2304,44,227,_binary '\0',0),(2305,44,233,_binary '\0',0),(2306,44,234,_binary '\0',0),(2307,44,238,_binary '\0',0),(2308,44,241,_binary '\0',0),(2309,44,242,_binary '\0',0),(2310,44,243,_binary '\0',0),(2311,44,244,_binary '\0',0),(2312,44,248,_binary '\0',0),(2313,44,255,_binary '\0',0),(2314,44,262,_binary '\0',0),(2315,44,263,_binary '\0',0),(2316,44,266,_binary '\0',0),(2317,44,267,_binary '\0',0),(2318,44,275,_binary '\0',0),(2319,44,276,_binary '\0',0),(2320,44,277,_binary '\0',0),(2321,44,278,_binary '\0',0),(2322,44,279,_binary '\0',0),(2323,44,280,_binary '\0',0),(2324,44,281,_binary '\0',0),(2325,44,282,_binary '\0',0),(2326,44,283,_binary '\0',0),(2327,44,288,_binary '\0',0),(2328,44,292,_binary '\0',0),(2329,44,293,_binary '\0',0),(2330,44,294,_binary '\0',0),(2331,44,295,_binary '\0',0),(2332,44,297,_binary '\0',0),(2333,44,352,_binary '\0',0),(2334,45,218,_binary '\0',0),(2335,45,222,_binary '\0',0),(2336,45,227,_binary '\0',0),(2337,45,233,_binary '\0',0),(2338,45,234,_binary '\0',0),(2339,45,238,_binary '\0',0),(2340,45,241,_binary '\0',0),(2341,45,242,_binary '\0',0),(2342,45,243,_binary '\0',0),(2343,45,244,_binary '\0',0),(2344,45,248,_binary '\0',0),(2345,45,255,_binary '\0',0),(2346,45,262,_binary '\0',0),(2347,45,263,_binary '\0',0),(2348,45,266,_binary '\0',0),(2349,45,267,_binary '\0',0),(2350,45,275,_binary '\0',0),(2351,45,276,_binary '\0',0),(2352,45,277,_binary '\0',0),(2353,45,278,_binary '\0',0),(2354,45,279,_binary '\0',0),(2355,45,280,_binary '\0',0),(2356,45,281,_binary '\0',0),(2357,45,282,_binary '\0',0),(2358,45,283,_binary '\0',0),(2359,45,288,_binary '\0',0),(2360,45,292,_binary '\0',0),(2361,45,293,_binary '\0',0),(2362,45,294,_binary '\0',0),(2363,45,295,_binary '\0',0),(2364,45,297,_binary '\0',0),(2365,45,352,_binary '\0',0),(2366,46,218,_binary '\0',0),(2367,46,222,_binary '\0',0),(2368,46,227,_binary '\0',0),(2369,46,233,_binary '\0',0),(2370,46,234,_binary '\0',0),(2371,46,238,_binary '\0',0),(2372,46,241,_binary '\0',0),(2373,46,242,_binary '\0',0),(2374,46,243,_binary '\0',0),(2375,46,244,_binary '\0',0),(2376,46,248,_binary '\0',0),(2377,46,255,_binary '\0',0),(2378,46,262,_binary '\0',0),(2379,46,263,_binary '\0',0),(2380,46,266,_binary '\0',0),(2381,46,267,_binary '\0',0),(2382,46,275,_binary '\0',0),(2383,46,276,_binary '\0',0),(2384,46,277,_binary '\0',0),(2385,46,278,_binary '\0',0),(2386,46,279,_binary '\0',0),(2387,46,280,_binary '\0',0),(2388,46,281,_binary '\0',0),(2389,46,282,_binary '\0',0),(2390,46,283,_binary '\0',0),(2391,46,288,_binary '\0',0),(2392,46,292,_binary '\0',0),(2393,46,293,_binary '\0',0),(2394,46,294,_binary '\0',0),(2395,46,295,_binary '\0',0),(2396,46,297,_binary '\0',0),(2397,46,352,_binary '\0',0),(2398,47,218,_binary '\0',0),(2399,47,222,_binary '\0',0),(2400,47,227,_binary '\0',0),(2401,47,233,_binary '\0',0),(2402,47,234,_binary '\0',0),(2403,47,238,_binary '\0',0),(2404,47,241,_binary '\0',0),(2405,47,242,_binary '\0',0),(2406,47,243,_binary '\0',0),(2407,47,244,_binary '\0',0),(2408,47,248,_binary '\0',0),(2409,47,255,_binary '\0',0),(2410,47,262,_binary '\0',0),(2411,47,263,_binary '\0',0),(2412,47,266,_binary '\0',0),(2413,47,267,_binary '\0',0),(2414,47,275,_binary '\0',0),(2415,47,276,_binary '\0',0),(2416,47,277,_binary '\0',0),(2417,47,278,_binary '\0',0),(2418,47,279,_binary '\0',0),(2419,47,280,_binary '\0',0),(2420,47,281,_binary '\0',0),(2421,47,282,_binary '\0',0),(2422,47,283,_binary '\0',0),(2423,47,288,_binary '\0',0),(2424,47,292,_binary '\0',0),(2425,47,293,_binary '\0',0),(2426,47,294,_binary '\0',0),(2427,47,295,_binary '\0',0),(2428,47,297,_binary '\0',0),(2429,47,352,_binary '\0',0),(2430,48,218,_binary '\0',0),(2431,48,222,_binary '\0',0),(2432,48,227,_binary '\0',0),(2433,48,233,_binary '\0',0),(2434,48,234,_binary '\0',0),(2435,48,238,_binary '\0',0),(2436,48,241,_binary '\0',0),(2437,48,242,_binary '\0',0),(2438,48,243,_binary '\0',0),(2439,48,244,_binary '\0',0),(2440,48,248,_binary '\0',0),(2441,48,255,_binary '\0',0),(2442,48,262,_binary '\0',0),(2443,48,263,_binary '\0',0),(2444,48,266,_binary '\0',0),(2445,48,267,_binary '\0',0),(2446,48,275,_binary '\0',0),(2447,48,276,_binary '\0',0),(2448,48,277,_binary '\0',0),(2449,48,278,_binary '\0',0),(2450,48,279,_binary '\0',0),(2451,48,280,_binary '\0',0),(2452,48,281,_binary '\0',0),(2453,48,282,_binary '\0',0),(2454,48,283,_binary '\0',0),(2455,48,288,_binary '\0',0),(2456,48,292,_binary '\0',0),(2457,48,293,_binary '\0',0),(2458,48,294,_binary '\0',0),(2459,48,295,_binary '\0',0),(2460,48,297,_binary '\0',0),(2461,48,352,_binary '\0',0),(2462,49,218,_binary '\0',0),(2463,49,222,_binary '\0',0),(2464,49,227,_binary '\0',0),(2465,49,233,_binary '\0',0),(2466,49,234,_binary '\0',0),(2467,49,238,_binary '\0',0),(2468,49,241,_binary '\0',0),(2469,49,242,_binary '\0',0),(2470,49,243,_binary '\0',0),(2471,49,244,_binary '\0',0),(2472,49,248,_binary '\0',0),(2473,49,255,_binary '\0',0),(2474,49,262,_binary '\0',0),(2475,49,263,_binary '\0',0),(2476,49,266,_binary '\0',0),(2477,49,267,_binary '\0',0),(2478,49,275,_binary '\0',0),(2479,49,276,_binary '\0',0),(2480,49,277,_binary '\0',0),(2481,49,278,_binary '\0',0),(2482,49,279,_binary '\0',0),(2483,49,280,_binary '\0',0),(2484,49,281,_binary '\0',0),(2485,49,282,_binary '\0',0),(2486,49,283,_binary '\0',0),(2487,49,288,_binary '\0',0),(2488,49,292,_binary '\0',0),(2489,49,293,_binary '\0',0),(2490,49,294,_binary '\0',0),(2491,49,295,_binary '\0',0),(2492,49,297,_binary '\0',0),(2493,49,352,_binary '\0',0),(2494,50,218,_binary '\0',0),(2495,50,222,_binary '\0',0),(2496,50,227,_binary '\0',0),(2497,50,233,_binary '\0',0),(2498,50,234,_binary '\0',0),(2499,50,238,_binary '\0',0),(2500,50,241,_binary '\0',0),(2501,50,242,_binary '\0',0),(2502,50,243,_binary '\0',0),(2503,50,244,_binary '\0',0),(2504,50,248,_binary '\0',0),(2505,50,255,_binary '\0',0),(2506,50,262,_binary '\0',0),(2507,50,263,_binary '\0',0),(2508,50,266,_binary '\0',0),(2509,50,267,_binary '\0',0),(2510,50,275,_binary '\0',0),(2511,50,276,_binary '\0',0),(2512,50,277,_binary '\0',0),(2513,50,278,_binary '\0',0),(2514,50,279,_binary '\0',0),(2515,50,280,_binary '\0',0),(2516,50,281,_binary '\0',0),(2517,50,282,_binary '\0',0),(2518,50,283,_binary '\0',0),(2519,50,288,_binary '\0',0),(2520,50,292,_binary '\0',0),(2521,50,293,_binary '\0',0),(2522,50,294,_binary '\0',0),(2523,50,295,_binary '\0',0),(2524,50,297,_binary '\0',0),(2525,50,352,_binary '\0',0),(2526,51,218,_binary '\0',0),(2527,51,222,_binary '\0',0),(2528,51,227,_binary '\0',0),(2529,51,233,_binary '\0',0),(2530,51,234,_binary '\0',0),(2531,51,238,_binary '\0',0),(2532,51,241,_binary '\0',0),(2533,51,242,_binary '\0',0),(2534,51,243,_binary '\0',0),(2535,51,244,_binary '\0',0),(2536,51,248,_binary '\0',0),(2537,51,255,_binary '\0',0),(2538,51,262,_binary '\0',0),(2539,51,263,_binary '\0',0),(2540,51,266,_binary '\0',0),(2541,51,267,_binary '\0',0),(2542,51,275,_binary '\0',0),(2543,51,276,_binary '\0',0),(2544,51,277,_binary '\0',0),(2545,51,278,_binary '\0',0),(2546,51,279,_binary '\0',0),(2547,51,280,_binary '\0',0),(2548,51,281,_binary '\0',0),(2549,51,282,_binary '\0',0),(2550,51,283,_binary '\0',0),(2551,51,288,_binary '\0',0),(2552,51,292,_binary '\0',0),(2553,51,293,_binary '\0',0),(2554,51,294,_binary '\0',0),(2555,51,295,_binary '\0',0),(2556,51,297,_binary '\0',0),(2557,51,352,_binary '\0',0),(2558,52,218,_binary '\0',0),(2559,52,222,_binary '\0',0),(2560,52,227,_binary '\0',0),(2561,52,233,_binary '\0',0),(2562,52,234,_binary '\0',0),(2563,52,238,_binary '\0',0),(2564,52,241,_binary '\0',0),(2565,52,242,_binary '\0',0),(2566,52,243,_binary '\0',0),(2567,52,244,_binary '\0',0),(2568,52,248,_binary '\0',0),(2569,52,255,_binary '\0',0),(2570,52,262,_binary '\0',0),(2571,52,263,_binary '\0',0),(2572,52,266,_binary '\0',0),(2573,52,267,_binary '\0',0),(2574,52,275,_binary '\0',0),(2575,52,276,_binary '\0',0),(2576,52,277,_binary '\0',0),(2577,52,278,_binary '\0',0),(2578,52,279,_binary '\0',0),(2579,52,280,_binary '\0',0),(2580,52,281,_binary '\0',0),(2581,52,282,_binary '\0',0),(2582,52,283,_binary '\0',0),(2583,52,288,_binary '\0',0),(2584,52,292,_binary '\0',0),(2585,52,293,_binary '\0',0),(2586,52,294,_binary '\0',0),(2587,52,295,_binary '\0',0),(2588,52,297,_binary '\0',0),(2589,52,352,_binary '\0',0);
/*!40000 ALTER TABLE `reg_course_field` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_exam_course`
--

LOCK TABLES `reg_exam_course` WRITE;
/*!40000 ALTER TABLE `reg_exam_course` DISABLE KEYS */;
/*!40000 ALTER TABLE `reg_exam_course` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_exam_hour_config`
--

LOCK TABLES `reg_exam_hour_config` WRITE;
/*!40000 ALTER TABLE `reg_exam_hour_config` DISABLE KEYS */;
INSERT INTO `reg_exam_hour_config` VALUES ('10 صبح'),('10:30 صبح'),('14 عصر'),('15:30 عصر'),('16 عصر'),('17 عصر'),('17:30 عصر'),('7 صبح'),('8 صبح'),('9:30 صبح');
/*!40000 ALTER TABLE `reg_exam_hour_config` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_exam_kart_config`
--

LOCK TABLES `reg_exam_kart_config` WRITE;
/*!40000 ALTER TABLE `reg_exam_kart_config` DISABLE KEYS */;
INSERT INTO `reg_exam_kart_config` VALUES (1,'شیرین حاجی زاده','مدرسه آوید','مدرسه آوید');
/*!40000 ALTER TABLE `reg_exam_kart_config` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_exam_time`
--

LOCK TABLES `reg_exam_time` WRITE;
/*!40000 ALTER TABLE `reg_exam_time` DISABLE KEYS */;
/*!40000 ALTER TABLE `reg_exam_time` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_field`
--

LOCK TABLES `reg_field` WRITE;
/*!40000 ALTER TABLE `reg_field` DISABLE KEYS */;
INSERT INTO `reg_field` VALUES (1,'ریاضی و فیزیک',_binary '',NULL),(2,'ادبیات و علوم انسانی',_binary '',NULL),(3,'علوم تجربی',_binary '',NULL),(4,'متوسطه اول',_binary '',''),(5,'مدیریت و برنامه ریزی خانواده',_binary '','94101'),(6,'چاپ دستی',_binary '','99201'),(7,'تصویربرداری',_binary '',NULL),(8,'عیب‌یابی و مونتاژ سیم‌های رایانه‌ای',_binary '','61381'),(9,'تعمیر تلفن‌های رومیزی و همراه',_binary '','91112'),(10,'تعمیر دستگاه اداری',_binary '','91113'),(11,'تولید و توسعه‌دهنده پایگاه‌های اینترنتی',_binary '','91125'),(12,'تولید محتوای آموزشی الکترونیکی',_binary '','91123'),(13,'نقشه‌کشی صنعتی با رایانه',_binary '','61011'),(14,'نقشه‌کشی ساختمان',_binary '','61841'),(15,'امور باغی گیاهان زینتی و فضای سبز',_binary '','81211'),(16,'امور زراعی گیاهان دارویی',_binary '','81121'),(17,'دامپروری طیور و دام',_binary '','81112'),(18,'دامپروری طیور و حشرات مفید',_binary '','81111'),(19,'شیلات',_binary '','83110'),(20,'نان، شیرینی و شکلات',_binary '','92173'),(21,'دوخت لباس‌های محلی',_binary '\0','61501'),(22,'دوخت لباس‌های سنتی',_binary '\0','93155'),(23,'سراجی کیف',_binary '','93151'),(24,'سراجی دوزنده کفش',_binary '','93152'),(25,'تصویرسازی و جلوه‌های ویژه رایانه‌ای',_binary '','62321'),(26,'طراحی طلا و جواهر',_binary '','62261'),(27,'طلا و جواهرسازی',_binary '','93141'),(28,'تراش و تزئین شیشه و کریستال',_binary '','99441'),(29,'قلم‌زنی روی فلز',_binary '','97371'),(30,'تراش سنگ‌های قیمتی',_binary '','98471'),(31,'هنر آیینه‌کاری',_binary '','99221'),(32,'گرافیک رایانه‌ای',_binary '','99011'),(33,'عکاسی دیجیتال',_binary '','99211'),(34,'سازسازی (سنتور و سه‌تار)',_binary '','99171'),(35,'سازسازی سنتور (سه‌تار و ساز ضربی)',_binary '','99181'),(36,'سازسازی (سنتور و ساز ضربی)',_binary '','99261'),(37,'نوازندگی ساز ایرانی',_binary '','99411'),(38,'نوازندگی ساز جهانی',_binary '','99421'),(39,'آواز ایرانی',_binary '','99431'),(40,'آواز جهانی',_binary '','99361'),(41,'نگارگری',_binary '','99061'),(42,'تذهیب و تشعیر',_binary '','99071'),(43,'چهره‌سازی',_binary '','99161'),(44,'نقاشی ایرانی',_binary '','98411'),(45,'چهره‌پردازی',_binary '','93111'),(46,'چاپ باتیک و سیلک اسکرین',_binary '','98491'),(47,'صحافی و جلدسازی',_binary '','98501'),(48,'امور اداری',_binary '','94201'),(49,'مدیریت آشپزی و قنادی',_binary '','62241'),(50,'هتلداری',_binary '','61741'),(51,'راهنمای گردشگری',_binary '','62201'),(52,'تولید و پرورش گیاهان زینتی',_binary '','92152');
/*!40000 ALTER TABLE `reg_field` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_identifier_code`
--

LOCK TABLES `reg_identifier_code` WRITE;
/*!40000 ALTER TABLE `reg_identifier_code` DISABLE KEYS */;
INSERT INTO `reg_identifier_code` VALUES (1,'الف'),(2,'ب'),(3,'پ'),(4,'ت'),(5,'ث'),(6,'ج'),(7,'چ'),(8,'ح'),(9,'خ'),(10,'د'),(11,'ذ'),(12,'ر'),(13,'ز'),(14,'ژ'),(15,'س'),(16,'ش'),(17,'ص'),(18,'ض'),(19,'ط'),(20,'ظ'),(21,'ع'),(22,'غ'),(23,'ف'),(24,'ق'),(25,'ک'),(26,'گ'),(27,'ل'),(28,'م'),(29,'ن'),(30,'و'),(31,'ه'),(32,'ی'),(42,'یک المثني'),(43,' دو المثني'),(44,'سه المثني'),(45,'چهار المثني'),(46,'پنج المثني'),(47,'شش المثني'),(48,'هفت المثني'),(49,'هشت المثني'),(50,'نه المثني'),(51,'ده المثني'),(52,'يازده المثني'),(53,'دوازده المثني');
/*!40000 ALTER TABLE `reg_identifier_code` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_level`
--

LOCK TABLES `reg_level` WRITE;
/*!40000 ALTER TABLE `reg_level` DISABLE KEYS */;
INSERT INTO `reg_level` VALUES (1,'دوره اول متوسطه'),(2,'دوره دوم  متوسطه  نظری'),(3,'دوره دوم متوسطه کاردانش');
/*!40000 ALTER TABLE `reg_level` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_organization`
--

LOCK TABLES `reg_organization` WRITE;
/*!40000 ALTER TABLE `reg_organization` DISABLE KEYS */;
INSERT INTO `reg_organization` VALUES (1,'مرکزی');
/*!40000 ALTER TABLE `reg_organization` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_persian_day`
--

LOCK TABLES `reg_persian_day` WRITE;
/*!40000 ALTER TABLE `reg_persian_day` DISABLE KEYS */;
INSERT INTO `reg_persian_day` VALUES (0,'دوشنبه'),(1,'سه شنبه'),(2,'چهارشنبه'),(3,'پنجشنبه'),(4,'جمعه'),(5,'شنبه'),(6,'یکشنبه');
/*!40000 ALTER TABLE `reg_persian_day` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_receivable`
--

LOCK TABLES `reg_receivable` WRITE;
/*!40000 ALTER TABLE `reg_receivable` DISABLE KEYS */;
INSERT INTO `reg_receivable` VALUES (34028,34027,'2025-01-21 00:00:00',34029),(34029,34027,'2025-11-18 00:00:00',34029),(34030,34028,'2025-11-18 00:00:00',34030),(34031,34029,'2025-11-18 00:00:00',34031);
/*!40000 ALTER TABLE `reg_receivable` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_reg_check`
--

LOCK TABLES `reg_reg_check` WRITE;
/*!40000 ALTER TABLE `reg_reg_check` DISABLE KEYS */;
/*!40000 ALTER TABLE `reg_reg_check` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_reg_course`
--

LOCK TABLES `reg_reg_course` WRITE;
/*!40000 ALTER TABLE `reg_reg_course` DISABLE KEYS */;
/*!40000 ALTER TABLE `reg_reg_course` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_reg_payment`
--

LOCK TABLES `reg_reg_payment` WRITE;
/*!40000 ALTER TABLE `reg_reg_payment` DISABLE KEYS */;
INSERT INTO `reg_reg_payment` VALUES (44158,'2025-10-20 00:00:00',34030,44249,NULL),(44159,'2025-11-18 00:00:00',34031,44250,NULL);
/*!40000 ALTER TABLE `reg_reg_payment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_registration`
--

LOCK TABLES `reg_registration` WRITE;
/*!40000 ALTER TABLE `reg_registration` DISABLE KEYS */;
INSERT INTO `reg_registration` VALUES (34029,'2025-11-18 00:00:00',372208991,32,9332,3,18.00,108,4400000,0,1450000,NULL,0,30500000,0,NULL,NULL),(34030,'2025-11-18 00:00:00',1282728301,32,9332,3,11.00,66,4400000,0,1450000,'ثبت مهارت +مدرک',4900000,25250000,0,NULL,NULL),(34031,'2025-11-18 00:00:00',5659277004,32,9332,3,18.00,108,4400000,0,1450000,NULL,0,30500000,0,NULL,NULL);
/*!40000 ALTER TABLE `reg_registration` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_salary_param`
--

LOCK TABLES `reg_salary_param` WRITE;
/*!40000 ALTER TABLE `reg_salary_param` DISABLE KEYS */;
INSERT INTO `reg_salary_param` VALUES (9332,1,4400000,0,1350000,NULL),(9332,2,4400000,0,1450000,NULL),(9332,3,4400000,0,1450000,NULL);
/*!40000 ALTER TABLE `reg_salary_param` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_school`
--

LOCK TABLES `reg_school` WRITE;
/*!40000 ALTER TABLE `reg_school` DISABLE KEYS */;
/*!40000 ALTER TABLE `reg_school` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_student`
--

LOCK TABLES `reg_student` WRITE;
/*!40000 ALTER TABLE `reg_student` DISABLE KEYS */;
INSERT INTO `reg_student` VALUES ('فاطمه','ابراهیم خمیسی','0372208991',NULL,NULL,1,372208991,'حسین','1998-11-11',NULL,1,1,'2025-11-18 00:00:00','2025-11-18 00:00:00',NULL,NULL,NULL,'09023164468',NULL,NULL,NULL,NULL),('زهرا','اسحقی','1282728301',NULL,NULL,1,1282728301,'محمود','1980-12-23',NULL,1,1,'2025-11-18 00:00:00','2025-11-18 00:00:00',NULL,NULL,NULL,'09140401548',NULL,NULL,NULL,NULL),('زهره','باقری','5659277004',NULL,NULL,1,5659277004,'حیدر','1978-09-23',NULL,1,1,'2025-11-18 00:00:00','2025-11-18 00:00:00',NULL,NULL,NULL,'09130152534',NULL,NULL,NULL,NULL);
/*!40000 ALTER TABLE `reg_student` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_student_account`
--

LOCK TABLES `reg_student_account` WRITE;
/*!40000 ALTER TABLE `reg_student_account` DISABLE KEYS */;
INSERT INTO `reg_student_account` VALUES (372208991,14208,'2025-11-18 00:00:00'),(1282728301,14209,'2025-11-18 00:00:00'),(5659277004,14210,'2025-11-18 00:00:00');
/*!40000 ALTER TABLE `reg_student_account` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_student_image`
--

LOCK TABLES `reg_student_image` WRITE;
/*!40000 ALTER TABLE `reg_student_image` DISABLE KEYS */;
/*!40000 ALTER TABLE `reg_student_image` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_student_status`
--

LOCK TABLES `reg_student_status` WRITE;
/*!40000 ALTER TABLE `reg_student_status` DISABLE KEYS */;
INSERT INTO `reg_student_status` VALUES (1,'فعال'),(2,'انتقال رفته'),(3,'بلاتکلیف'),(4,'ترک تحصیل'),(5,'فارغ التحصیل');
/*!40000 ALTER TABLE `reg_student_status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `reg_term`
--

LOCK TABLES `reg_term` WRITE;
/*!40000 ALTER TABLE `reg_term` DISABLE KEYS */;
INSERT INTO `reg_term` VALUES (9332,'نیم سال اول 404- 405','2025-09-23','2026-02-19',_binary '',4,4);
/*!40000 ALTER TABLE `reg_term` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `st_govahi_vaziat`
--

LOCK TABLES `st_govahi_vaziat` WRITE;
/*!40000 ALTER TABLE `st_govahi_vaziat` DISABLE KEYS */;
/*!40000 ALTER TABLE `st_govahi_vaziat` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `temp_test2`
--

LOCK TABLES `temp_test2` WRITE;
/*!40000 ALTER TABLE `temp_test2` DISABLE KEYS */;
/*!40000 ALTER TABLE `temp_test2` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `test_table`
--

LOCK TABLES `test_table` WRITE;
/*!40000 ALTER TABLE `test_table` DISABLE KEYS */;
/*!40000 ALTER TABLE `test_table` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping data for table `tmp_st`
--

LOCK TABLES `tmp_st` WRITE;
/*!40000 ALTER TABLE `tmp_st` DISABLE KEYS */;
/*!40000 ALTER TABLE `tmp_st` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-11-30 13:55:56
